---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailHeight
source: html/16205619-3961-44e2-577a-b13af9c92952.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailHeight Property

The height of the secondary handrail.

## Syntax (C#)
```csharp
public double SecondaryHandrailHeight { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The rail has no secondary hand rail.